-- MySQL dump 10.13  Distrib 8.0.25, for Win64 (x86_64)
--
-- Host: localhost    Database: finance
-- ------------------------------------------------------
-- Server version	8.0.25

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `ae_bankruptcy_list`
--

DROP TABLE IF EXISTS `ae_bankruptcy_list`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `ae_bankruptcy_list` (
  `company` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `abbr` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `TSE_industry_new` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ae_bankruptcy_list`
--

LOCK TABLES `ae_bankruptcy_list` WRITE;
/*!40000 ALTER TABLE `ae_bankruptcy_list` DISABLE KEYS */;
INSERT INTO `ae_bankruptcy_list` VALUES ('1104','環泥','水泥工業'),('1201','味全','食品工業'),('1201','味全','食品工業'),('1210','大成','食品工業'),('1225','福懋油','食品工業'),('1236','宏亞','食品工業'),('1258','其祥-KY','食品工業'),('1316','上曜','建材營造'),('1326','台化','塑膠工業'),('1341','富林-KY','塑膠工業'),('1416','廣豐','其他'),('1417','嘉裕','紡織纖維'),('1440','南紡','紡織纖維'),('1446','宏和','紡織纖維'),('1452','宏益','紡織纖維'),('1452','宏益','紡織纖維'),('1471','首利','電子零組件'),('1507','永大','電機機械'),('1529','樂士','電機機械'),('1560','中砂','電機機械'),('1592','英瑞-KY','汽車工業'),('1734','杏輝','生技醫療'),('1735','日勝化','化學工業'),('1781','合世','生技醫療'),('1810','和成','玻璃陶瓷'),('2012','春雨','鋼鐵工業'),('2013','中鋼構','鋼鐵工業'),('2014','中鴻','鋼鐵工業'),('2020','美亞','鋼鐵工業'),('2025','千興','鋼鐵工業'),('2032','新鋼','鋼鐵工業'),('2059','川湖','電子零組件'),('2066','世德','電機機械'),('2325','矽品','半導體'),('2327','國巨','電子零組件'),('2332','友訊','通信網路業'),('2349','錸德','光電業'),('2358','廷鑫','其他'),('2368','金像電','電子零組件'),('2390','云辰','其他電子業'),('2404','漢唐','其他電子業'),('2414','精技','電子通路業'),('2419','仲琦','通信網路業'),('2433','互盛電','其他電子業'),('2434','統懋','半導體'),('2434','統懋','半導體'),('2439','美律','通信網路業'),('2456','奇力新','電子零組件'),('2461','光群雷','其他電子業'),('2478','大毅','電子零組件'),('2480','敦陽科','資訊服務業'),('2484','希華','電子零組件'),('2493','揚博','電子零組件'),('2496','卓越','其他'),('2535','達欣工','建材營造'),('2542','興富發','建材營造'),('2546','根基','建材營造'),('2605','新興','航運業'),('2607','榮運','航運業'),('2607','榮運','航運業'),('2608','嘉里大榮','航運業'),('2613','中櫃','航運業'),('2745','五福','觀光事業'),('2754','亞洲藏壽司','觀光事業'),('2756','聯發國際','觀光事業'),('2905','三商','貿易百貨'),('2906','高林','貿易百貨'),('2926','誠品生活','文化創意業'),('3010','華立','電子通路業'),('3019','亞光','光電業'),('3029','零壹','資訊服務業'),('3046','建碁','電腦及週邊'),('3049','和鑫','光電業'),('3058','立德','電子零組件'),('3105','穩懋','半導體'),('3105','穩懋','半導體'),('3114','好德','電子零組件'),('3122','笙泉','半導體'),('3131','弘塑','其他電子業'),('3163','波若威','通信網路業'),('3217','優群','電子零組件'),('3227','原相','半導體'),('3230','錦明','光電業'),('3260','威剛','半導體'),('3266','昇陽','建材營造'),('3297','杭特','光電業'),('3303','岱稜','其他電子業'),('3312','弘憶股','電子通路業'),('3362','先進光','光電業'),('3390','旭軟','電子零組件'),('3511','矽瑪','電子零組件'),('3518','柏騰','其他電子業'),('3521','鴻翊','電腦及週邊'),('3523','迎輝','光電業'),('3530','晶相光','半導體'),('3591','艾笛森','光電業'),('3592','瑞鼎','半導體'),('3632','研勤','通信網路業'),('3685','元創精密','光電業'),('3705','永信','生技醫療'),('3712','永崴投控','電腦及週邊'),('4105','東洋','生技醫療'),('4116','明基醫','生技醫療'),('4139','馬光-KY','生技醫療'),('4147','中裕','生技醫療'),('4150','優你康','生技醫療'),('4160','創源','生技醫療'),('4168','醣聯','生技醫療'),('4173','久裕','生技醫療'),('4188','安克','生技醫療'),('4190','佐登-KY','生技醫療'),('4413','飛寶企業','紡織纖維'),('4420','光明','紡織纖維'),('4438','廣越','紡織纖維'),('4503','金雨','電機機械'),('4528','江興鍛','電機機械'),('4530','宏易','電機機械'),('4536','拓凱','其他'),('4545','銘鈺','電子零組件'),('4563','百德','電機機械'),('4573','高明鐵','電機機械'),('4702','中美實','化學工業'),('4711','永純','化學工業'),('4714','永捷','化學工業'),('4735','豪展','生技醫療'),('4736','泰博','生技醫療'),('4737','華廣','生技醫療'),('4752','聯超','化學工業'),('4765','磐采','化學工業'),('4931','新盛力','電腦及週邊'),('4946','辣椒','文化創意業'),('4947','昂寶-KY','半導體'),('4968','立積','半導體'),('4974','亞泰','電子零組件'),('5011','久陽','鋼鐵工業'),('5234','達興材料','光電業'),('5264','鎧勝-KY','電腦及週邊'),('5269','祥碩','半導體'),('5285','界霖','半導體'),('5353','台林','通信網路業'),('5353','台林','通信網路業'),('5455','昇益','建材營造'),('5490','同亨','電腦及週邊'),('5516','雙喜','建材營造'),('5533','皇鼎','建材營造'),('5538','東明-KY','鋼鐵工業'),('5607','遠雄港','航運業'),('5609','中菲行','航運業'),('5871','中租-KY','其他'),('5902','德記','貿易百貨'),('6103','合邦','半導體'),('6126','信音','電子零組件'),('6151','晉倫','其他電子業'),('6191','精成科','電子零組件'),('6207','雷科','電子零組件'),('6212','理銘','建材營造'),('6217','中探針','電子零組件'),('6220','岳豐','電子零組件'),('6228','全譜','電腦及週邊'),('6233','旺玖','半導體'),('6241','易通展','通信網路業'),('6245','立端','通信網路業'),('6245','立端','通信網路業'),('6270','倍微','電子通路業'),('6275','元山','其他電子業'),('6279','胡連','電子零組件'),('6281','全國電','電子通路業'),('6283','淳安','其他電子業'),('6287','元隆','半導體'),('6423','億而得','半導體'),('6443','元晶','光電業'),('6477','安集','光電業'),('6488','環球晶','半導體'),('6538','倉和','電子零組件'),('6582','申豐','橡膠工業'),('6588','東典光電','通信網路業'),('6590','普鴻','資訊服務業'),('6591','動力-KY','電腦及週邊'),('6596','寬宏藝術','文化創意業'),('6603','富強鑫','電機機械'),('6606','建德工業','電機機械'),('6613','朋億','其他電子業'),('6624','萬年清','其他'),('6642','富致','電子零組件'),('6677','瑩碩生技','生技醫療'),('6683','雍智科技','半導體'),('6684','安格','半導體'),('6706','惠特','光電業'),('6715','嘉基','電子零組件'),('6737','秀育','電腦及週邊'),('6775','穎台科技','光電業'),('6817','溫士頓','生技醫療'),('8032','光菱','電子通路業'),('8033','雷虎','其他'),('8039','台虹','電子零組件'),('8041','東精電','電機機械'),('8068','全達','電子通路業'),('8074','鉅橡','電子零組件'),('8086','宏捷科','半導體'),('8104','錸寶','光電業'),('8201','無敵','其他電子業'),('8215','明基材','光電業'),('8277','商丞','半導體'),('8289','泰藝','電子零組件'),('8367','建新國際','航運業'),('8390','金益鼎','其他'),('8420','明揚','其他'),('8442','威宏-KY','其他'),('8446','華研','文化創意業'),('8450','霹靂','文化創意業'),('8467','波力-KY','其他'),('8467','波力-KY','其他'),('8488','吉源-KY','其他'),('8495','經緯航','其他'),('8499','鼎炫-KY','其他'),('8923','時報','文化創意業'),('8928','鉅明','其他'),('8929','富堡','其他'),('8933','愛地雅','其他'),('9908','大台北','油電燃氣業'),('9914','美利達','其他');
/*!40000 ALTER TABLE `ae_bankruptcy_list` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-06-02 21:34:20
